# -*- coding: utf-8 -*-
# @Time  : 2023/04/21 20:51
# @author: dtf

'''
常见考点：
字符串，数组，位运算，进制转换，进位计算，线性表，排序及查找，双指针，回溯，深搜，广搜，贪心，递归。

1、OD机考：第1、2题（各100分）
字符串
数组、列表、字典、元组
哈希表（字典）
优先队列（堆）
排序
二叉树（前序遍历、中序遍历、后序遍历）
链表（创建、删除）

2、OD机考：第3题（200分）
二分查找
贪心算法
动态规划
滑动窗口

深度优先搜索
广度优先搜索
'''

'''
！！！！！！感悟！！！！！！
（1）切忌不要复制网上搜到的现成代码。
（2）动态规划、DFS等方法实在想不起来有的用暴力遍历的方法也能过个40%、50%，拿分过线就行了。
（3）需要全程开启摄像头，手机也需要扫码监控；将后台没用的网页全部关掉；要求手机屏幕全程保持亮屏并停留在小程序界面
（4）能用现成的工具方法就用，不要自己去实现，像常用的排序、进制转换等不管什么语言都是有工具类可用的。

（5）前面2道题可以来回切换来看，优先做最有把握的，但一旦切换到最后1道题就不能切换回来看前面的题！！！ （注意谨慎操作）；
（6）机考链接有效期 7天，收到机考邮件后，要7天内完成考试（否则有过期风险）；
（7）机考3道题（2道easy，1道mid，100+100+200共 400分，考试时间 2.5h）；

（8）机考分数是按照题目用例的通过数量的比例算分数（若最后一道题做不出来，可将边界情况结果等写出来）
（9）不会复杂的算法怎么办？熟练掌握【数组、链表、哈希表、队列】数据结构以及常用的函数，使用暴力破解

（10）如打开链接后，页面空白且无任何提示，可修改链接最前面的”exam”为”w1″。
'''